app/controllers/sessions_controller.rb

UPDATE "users" SET "remember_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["remember_digest", "$2a$04$dgexqprnHz9Di1IjSKzZJ.eAjP/4xf3LUXyq2xjZepE44N3GLpK2K"], ["updated_at", "2015-01-25 03:43:04.335852"], ["id", 579414386]]
---
  def create
    created_user = User.from_omniauth(env["omniauth.auth"])
    create_state
    log_in created_user
    # get list of redis groups associated with the new user: email -> [g1,g2...gn]
    new_group_list = $redis.lrange(created_user.email,0,-1)
    # for each new group, add a new relationship
    new_group_list.each do |group|
        # redirect_to url_for(:controller => :groups, :action => :add_user_to_group, :newmemberemail => created_user.email, :groupid => group.id)

        @new_group_relationship = Relationship.new(user_id:created_user.id, group_id:Group.find_by_id(group).id)
        @new_group_relationship.save