app/controllers/users_controller.rb

SELECT  "users".* FROM "users" LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "users"
---
  def index
    @users = User.paginate(page: params[:page])

INSERT INTO "users" ("name", "email", "password_digest", "created_at", "updated_at", "activation_digest") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
  	user_params = params.require(:user).permit(:name, :email, :password, :password_confirmation)
  	@user = User.new(user_params)
    if @user.save

DELETE FROM "users" WHERE "users"."id" = ?  [["id", 950961012]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 950961012]]
---
  def destroy
    User.find(params[:id]).destroy

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 950961012]]
UPDATE "users" SET "name" = ?, "email" = ?, "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "Foo Bar"], ["email", "foo@bar.com"], ["password_digest", "$2a$04$It2/Mo/vkvp5XTQIl55rK.RkZASJuaJbdlq2r6S4e1VzfTHw8qBDG"], ["updated_at", "2015-01-25 03:43:05.037740"], ["id", 579414386]]
---
  def update
    @user = User.find(params[:id])
    user_params = params.require(:user).permit(:name, :email, :password, :password_confirmation)
    if @user.update_attributes(user_params)